fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Год = Неопределено;

    Если Параметры.Свойство("Год") Тогда
        Год = Параметры.Год;
    КонецЕсли;

    Если Параметры.Свойство("АдресДанных") Тогда
        АдресДанных = Параметры.АдресДанных;
    КонецЕсли;

    Если Год = Неопределено Тогда
        Год = Год(ТекущаяДатаСеанса());
    КонецЕсли;

    Заголовок = СтрШаблон("Анализ графика отпусков за %1 год", Формат(Год, "ЧГ=0"));

    ПостроитьДиаграммуГанта(Год);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграммуГанта(Год)
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	НачалоГода  = НачалоГода(Год);
	КонецГода   = КонецГода(НачалоГода);
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода, КонецГода);
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресДанных) Тогда
		Диаграмма.Обновление = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(АдресДанных);
	Если ТаблицаОтпусков = Неопределено ИЛИ ТаблицаОтпусков.Количество() = 0 Тогда
		Диаграмма.Обновление = Истина;
		Возврат;
	КонецЕсли;
	
	Серия = Диаграмма.Серии.Добавить();
	Серия.Текст = "Отпуск";
	
	СоответствиеТочек = Новый Соответствие;
	
	Для Каждого Строка Из ТаблицаОтпусков Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.ДатаНачала)
		 ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаОкончания)
		 ИЛИ Строка.ДатаОкончания < Строка.ДатаНачала Тогда
			Продолжить;
		КонецЕсли;

		Если Строка.ДатаОкончания < НачалоГода ИЛИ Строка.ДатаНачала > КонецГода Тогда
			Продолжить;
		КонецЕсли;
		
		Точка = СоответствиеТочек.Получить(Строка.Сотрудник);
		Если Точка = Неопределено Тогда
			Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
			Точка.Текст = СокрЛП(Строка(Строка.Сотрудник));
			СоответствиеТочек.Вставить(Строка.Сотрудник, Точка);
		КонецЕсли;
		
		Интервал = Диаграмма.ПолучитьЗначение(Точка, Серия).Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец  = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	ДобавитьПолосыВыходных(НачалоГода, КонецГода);
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьПолосыВыходных(НачГода, КонГода)
	
	Неделя    = 86400 * 7;
	ДваДня    = 86400 * 2;
	
	ТекНачало = НачГода;
	
	Пока ТекНачало <= КонГода Цикл
		
		НачФона = НачалоНедели(ТекНачало) - ДваДня;
		КонФона = НачалоНедели(ТекНачало);
		
		Если КонФона >= НачГода И НачФона <= КонГода Тогда
			Диаграмма.ИнтервалыФона.Добавить(НачФона, КонФона);
		КонецЕсли;
		
		ТекНачало = ТекНачало + Неделя;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
